

# C++ 黑马程序员课程总结

## 入门篇
### 1. 关于常量的定义
   * 宏常量： 写法为```define  week 7``` (无 “；”)，可以在数组中使用，是全局常量，此时week和常数7挂钩，不可改变
   * const修饰的变量： 写法为```const int week = 7;```，其本质是int类型的不可修改**变量**，不能在int[]初始化中使用

### 2. 关于头文件(.h)的声明和实现(.cpp)的关系

   * .h文件
     * 全局变量要声明是extern的形式：```extern int Num_h ;```而不要去初始化该变量，否则会引发重复定义问题。
     * 在全局变量前加入extern 的声明， 则意味着此变量的作用域不再局限于此(.h)和(.cpp)文件，即只要编译且链接的所有文件均可使用。这会导致各类重定向问题，作用域不明确问题（常常发生在不同文件但具有同名变量或函数的情况下）。
     * 函数则一般不用追加extern，不推荐，这会导致该函数及其同名函数成为该命名空间下的重写。

   * .cpp文件

     * 用于实现再.h文件中定义好的变量和函数。

     * 不要extern 函数，需要用的话就#include ，否则常常出现单方面修改函数原型的错误，例如函数里的类会出现不知道自己的作用域和定义在哪儿的情况。（**这个我也不懂**，就少用吧）


### 3. extern关键字【弄不懂啊  先算了】

   * 在extern 之后会自动在已经编译链接的文件中寻找该存储在全局区的该同名全局变量或全局函数

   * 用法：

     * **修饰全局变量**：在声明全局变量的时候使用extern修饰变量，表明该变量定义于其他翻译单元。

       ```c++
       //file1
       int i = 0; //默认拥有外部链接
       extern int j; //j定义于其他翻译单元
       extern int i = 10; //与 int i = 0 相同，这里extern被忽略，属于重复定义
       
       /*请注意，对于全局变量，如果语句中没有extern也没有显示赋值，编译器（在VS2017中实测）会帮忙初始化变量为0，这种情况会视为变量定义，但是却不会与之后的变量定义发生冲突，所以这么写是可以的*/
       //file1
       int i; //编译器会帮忙初始化0
       extern int i = 10; //第二次变量定义，但是这里却是允许的，变量变成了10
       ```

     * **修饰全局常量**：表明该全局常量拥有外部链接（可以被其他翻译单元发现），否则全局常量默认是只有内部链接，即不可被其他翻译单元发现。

       ```c++
       //file1
       extern const int J = 10; //定义拥有外部链接的全局常量J
       
       //file2
       extern const int J; //声明全局常量J来自于其他翻译单元
       ```

     * **修饰局部变量**：表明该局部变量在其他翻译单元中被定义，需要在链接的时候去解析。

       ```
       void Test()
       {

    ostream& operator<<(ostream& out, const Num& temp)//这里不可以加const ostream，ostream实现里没有这个
    {
        out<< temp.n;
        return out;
    }
    
    //类外实现++运算符
    Num& operator++( Num& a)// 前置++
    {
        a.n++;
        return a;
    }
    
    Num& operator++(Num& a, int)// 后置++
    {
        Num temp(a.n);
        a.n++;
        return temp;
    }
    
    void test()
    {
        Num n;
        Num m;
        m.n = 3;
        
        n = m;
        cout << &n << "\t value = " << n.n << endl;
        n = 6;
        cout << &n << "\t value = " << n.n << endl;
    }// 这样就可以给一个Num的类型做=操作，如果不自己定义=操作的话，编译器给出一个浅拷贝版本，这使得n = m还可以做，但n = 6就会报错。
    // 类似的== ++ -- * << / 等都可以自己重定义。（operator= 必须是成员函数）
    ```

    * ⼀元操作符可以是不带参数的成员函数或带⼀个参数的⾮成员函数。
    * ⼆元操作符可以是带⼀个参数的成员函数或带两个参数的⾮成员函数。
    * operator=、operator[]、operator()、operator->只能定义为成员函数。
    * operator->的返回值必须是⼀个指针或能使⽤->的对象。
    * 重载 operator++ 和 operator--时带⼀个 int 参数表⽰后缀，不带参数表⽰前缀。
    * 除 operator new 和 operator delete 外，重载的操作符参数中⾄少要有⼀个⾮内建数据类型。
    * 重载的的操作符应尽量模拟操作符对内建类型的⾏为。

#### 继承

##### 继承的基本介绍

* 继承的好处： 减少代码量

* 继承的语法格式

  ```c++
  // 语法： class 子类 ： 继承方式 父类
  class A
  {
  
  }
  class B: public A
  {
  
  };
  ```

* 叫法

  A称为B的父类、基类

  B称为A的子类、派生类

* 派生类的成员
  * 包含父类继承过来的成员变量、函数等（需要按照权限来继承。
  * 自己本身所定义的成员变量和成员函数。
  * 父类的私有成员不会被子类继承（但可被友元访问

##### 继承方式

* 公共继承

  * 语法： ```class a : public b {};```
  * 将父类的public 和 protected 成员全部按照本身的权限继承下来

* 保护继承

  * 语法： ```class a : protected b {};```
  * 将父类的public 和 protected 成员全部按照保护权限继承下来

* 私有继承

  * 语法： ```class a : private b {};```
  * 将父类的public 和 protected 成员全部按照私有权限继承下来

  <img src = ".\picture\c++_jicheng_0.png" width = "100%">

##### 继承中的对象模型

* 主要问题是父类继承到子类的东西都有哪些？私有成员也继承了吗？

  * 全部都会继承下去(除了静态成员变量)，但是父类的私有成员会被编译器隐藏（加权限）

* 演示

  ```c++
  #include<iostream>
  #include<string>
  using namespace std;
  
  class base
  {
  public:
  	base() {}
  	int base_pub;
  	static int base_static_pub;
  	static void base_static_pub_fun() {};
  	void base_pub_fun() {}
  	~base(){}
  protected:
  	int base_pro;
  	static int base_static_pro;
  	void base_pro_fun() {}
  private:
  	int base_pri;
  	static int base_static_pri;
  	void base_pri_fun() {}
  	static void base_static_pri_fun() {};
  };
  
  class son: public base
  {
  public:
  	son() {}
  	int son_pub;
  
  	~son() {}
  protected:
  	int son_pro;
  	static int son_static_pro;
  	void son_pro_fun() {}
  private:
  	int base_pri;// 故意搞个同名的
  	static int base_static_pri;
  	void base_pri_fun() {} // 故意搞个同名的
  };
  
  void test()
  {
  	base b;
  	son s;
  }
  int main()
  {
      test();
  	system("pause");
  
  	return 0;
  }
  
  ```

  搞一手vs的分析工具 《Developer Command Prompt for VS 2022》

  输入命令```cl /d1 reportSingleClassLayoutson "main.cpp"```这里Layout后面是类名，”“里面是文件名

  结果如下

  ```powershell
  D:\Data_structure\Data_structure\c++\test>cl /d1 reportSingleClassLayoutson "main.cpp"
  用于 x86 的 Microsoft (R) C/C++ 优化编译器 19.33.31630 版
  版权所有(C) Microsoft Corporation。保留所有权利。
  
  main.cpp
  
  class son       size(24):
          +---
   0      | +--- (base class base)
   0      | | base_pub
   4      | | base_pro
   8      | | base_pri
          | +---
  12      | son_pub
  16      | son_pro
  20      | base_pri
          +---
  Microsoft (R) Incremental Linker Version 14.33.31630.0
  Copyright (C) Microsoft Corporation.  All rights reserved.
  
  /out:main.exe
  main.obj
  ```

  可以看到， base类的所有成员变量 全部继承到了，并且会在自己开辟空间将所有的属性都加进去，所以size是24 = 4*6

##### 构造和析构顺序

* 构造顺序是先父类 再子类
* 析构顺序是先子类 再父类
* 这和程序的栈顺序一致，先进后出

##### 同名成员处理（静态 非静态）

* 主要问题： 当子类和父类出现了同名的成员（变量、函数），编译器是否可以通过？如何调用？

  * 可以通过

  * 子类调用本身的同名成员，直接访问即可

  * 子类调用父类的同名成员，需要加作用域

  * 子类和父类出现同名的成员函数，子类会隐藏所有父类的同名成员函数（包括父类中的重载），要调用父类的函数需要加作用域。

  * 子类和父类出现同名的静态成员变量，可以通过加作用域的方式用类名直接访问父类的静态属性（静态属性只有一份，以下的方式对静态属性的修改都会导致其本身的修改）

    ```c++
    base b;
    cout << base::base_static_pub << endl;
    b.base_static_pub++;
    cout << base::base_static_pub << endl;
    son s;
    s.base_static_pub++;
    cout << base::base_static_pub << endl;
    son::base::base_static_pub++;
    cout << base::base_static_pub << endl;
    // 输出
    3
    4
    5
    6
    请按任意键继续. . .
    ```

##### 多继承以及其导致的问题

* 语法：```class 子类: 继承方式 父类， 继承方式 父类， ...```

* 问题：多继承可能会引发父类中有同名成员出现，需要加作用于区分，极易混淆，实际开发不建议多继承

* 典型问题一：菱形继承（钻石继承）

  * 菱形继承结构：两个派生类b，c继承基类a, d继承b和c

    ```c++
    class a
    {
    public:
    	int age;
    	a() : age(2){}
    };
    
    class b : public a
    {
    	int age;
    };
    class c : public a
    {
    	int age;
    };
    
    class dsda : public b, public c
    {
    	int age;
    };
    
    ```

    

  * 用开发工具分析一下

    ```powershell
    D:\Data_structure\Data_structure\c++\test>cl /d1 reportSingleClassLayoutdsda "main.cpp"
    用于 x86 的 Microsoft (R) C/C++ 优化编译器 19.33.31630 版
    版权所有(C) Microsoft Corporation。保留所有权利。
    
    main.cpp
    
    class dsda      size(20):
            +---
     0      | +--- (base class b)
     0      | | +--- (base class a)
     0      | | | age
            | | +---
     4      | | age
            | +---
     8      | +--- (base class c)
     8      | | +--- (base class a)
     8      | | | age
            | | +---
    12      | | age
            | +---
    16      | age
            +---
    Microsoft (R) Incremental Linker Version 14.33.31630.0
    Copyright (C) Microsoft Corporation.  All rights reserved.
    
    /out:main.exe
    main.obj
    ```

    如图，得继承5个age成员变量，如果要使用会变得极其复杂，并且我们知道一般一个对象有一个age就足够了。这里解决办法需要用到多态的虚继承。

  * 简单说一下虚继承，同样的代码，在继承时加上关键字```virtual```

    关于虚基类指针(vbptr)、虚函数指针(vfptr)、虚基类表(vbtable)、虚函数表(vftable)等到多态再仔细分析。

    利用虚继承之后，子类继承了父类对象的指针，指向子类里父类对象的地址，菱形继承后虽然继承的两个父类指针地址不一样，但是最初的基类的属性地址是唯一的，所以引入偏移量就可以使得基类里的属性在孙子类里保持一致，因为所有的指针访问的都是同一个地址的数据。

    ```powershell
    D:\Data_structure\Data_structure\c++\test>cl /d1 reportSingleClassLayoutdsda "main.cpp"
    用于 x86 的 Microsoft (R) C/C++ 优化编译器 19.33.31630 版
    版权所有(C) Microsoft Corporation。保留所有权利。
    
    main.cpp
    
    class dsda      size(28):
            +---                   //这里是dsda类的开始 
     0      | {vbptr}              // dsda 类含有一个虚基类指针,其指向需要查看自身的虚基类表,占了指针变量的四字节内存
     4      | age                  // dsda 类含有一个成员变量 age，占了int的4字节
            +---
            +--- (virtual base a)  // 这里是虚基类a
     8      | age                  // 这是虚基类a中成员的地址，是占了空间的，占了int的4字节
            +---
            +--- (virtual base b)  // 这里是虚基类b
    12      | {vbptr}              // 这说明虚基类b含有一个虚基类指针，现在位置是12，其指向需要查看自身的虚基类表的偏                                   移量，占了指针变量的四字节内存
    16      | age                  // 这是虚基类b中成员的地址，是占了空间的，占了int的4字节
            +---
            +--- (virtual base c)  // 这里是虚基类c
    20      | {vbptr}              // 这说明虚基类c含有一个虚基类指针，现在位置是20，其指向需要查看自身的虚基类表的偏                                   移量，占了指针变量的四字节内存占了指针变量的四字节内存
    24      | age                  // 这是虚基类b中成员的地址，是占了空间的，占了int的4字节
            +---
    
    dsda::$vbtable@dsda@:          // 这是dsda类的虚基类指针所指向的虚基类表
     0      | 0                    // dsda.vbptr指向自身的偏移量为0
     1      | 8 (dsdad(dsda+0)a)   // dsda.vbptr指向虚基类a的实际地址的偏移量为8，也就是指向了虚基类a的age位置
     2      | 12 (dsdad(dsda+0)b)  // dsda.vbptr指向虚基类b的实际地址的偏移量为12，指向了b的虚基类指针（b的虚基类指                                   针若想找到真正的值位置还需要查看自身的虚基类表）
     3      | 20 (dsdad(dsda+0)c)  // dsda.vbptr指向虚基类c的实际地址的偏移量为20，指向了c的虚基类指针（c的虚基类指                                   针若想找到真正的值位置还需要查看自身的虚基类表）
    
    dsda::$vbtable@b@:             // 这是虚基类b的虚基类表
     0      | 0                    // 虚基类b的指针指向自己的偏移量为0
     1      | -4 (dsdad(b+0)a)     // b.vbptr指向a的属性偏移量为-4，也就是12 - 4 = 8，指向了a的age位置
    
    dsda::$vbtable@c@:             // 这是虚基类c的虚基类表
     0      | 0                    // 虚基类c的指针指向自己的偏移量为0
     1      | -12 (dsdad(c+0)a)    // c.vbptr指向a的属性偏移量为-12，也就是20 - 12 = 8，指向了a的age位置
    vbi:       class  offset o.vbptr  o.vbte fVtorDisp // offset 是位置 别的不知道啊。。。
                   a       8       0       4 0
                   b      12       0       8 0
                   c      20       0      12 0
    Microsoft (R) Incremental Linker Version 14.33.31630.0
    Copyright (C) Microsoft Corporation.  All rights reserved.
    
    /out:main.exe
    main.obj
    ```

    

#### 多态

##### 虚函数指针、虚函数表

* 虚函数指针：指向一个虚函数表，本身是个void **类型
* 虚函数表：是个指针数组，**数组中每一个元素是一个虚函数的地址**。
* [(26条消息) C++多态的底层原理_卖寂寞的小男孩的博客-CSDN博客_c++多态底层原理](https://blog.csdn.net/qq_51492202/article/details/124393239)
* [C++ 对象的内存布局 | 酷 壳 - CoolShell](https://coolshell.cn/articles/12176.html)

##### 多态的基本概念

* 多态的概念：通俗来说，就是多种形态， **具体点就是去完成某个行为，当不同的对象去完成时会**

  **产生出不同的状态** 。

* 这就衍生出了重载、重写（覆盖）、隐藏等概念。

* 多态分为两类：

  * 静态多态：函数重载和运算符重载都属于静态多态，复用函数名
  * 动态多态：派生类和虚函数实现运行时多态
    * 满足继承关系
    * 子类重写父类的虚函数（不重写你用多态干啥）
    * 需要用父类指针来调用子类对象
  * 区别：
    * 静态多态的函数地址早绑定，编译阶段确定函数地址
    * 动态多态的函数地址晚绑定，运行时确定函数地址（实则是使用虚指针来实现，实质上还是编译阶段确定函数地址）

* 多态实例

  ```C++
  class Animal
  {
  public:
  	virtual void speak()
  	{
  		cout << "动物" << endl;
  	}
  };
  
  class Cat : public Animal
  {
  public:
  	void speak()
  	{
  		cout << "小猫" << endl;
  	}
  };
  // 地址早绑定，确定了an.speak指的是animal类下的函数
  // 如果想让猫的函数执行，需要将animal类下的函数变为虚函数
  void doSpeak(Animal& an)
  {
  	an.speak();
  }
  
  void test()
  {
  	Cat cat;
  	doSpeak(cat);// animal 中的speak()函数 不添加virtual， 则输出 动物，这也说明允许父子之间的类型转换
                   // 将animal下的speak 声明为virtual，则输出为小猫
  }
  ```

  分析一下：

  如果不是虚函数，则animal类中就没有虚函数指针，也没有虚函数表，那么dospeak里面执行an.speak()的时候，speak函数缺少了虚函数指针的参数（因为anima的this指针下的属性中没有虚函数指针），所以只能执行(this->speak())。

  当有了虚函数之后，animal类中会自动添加一个属性叫做(vfptr)，它指向一个虚函数表，animal类的指向自己的。并且这个animal.vfptr还会被cat类继承下去，并且指向小猫类的虚函数表，当小猫类重写speak时，会将继承自animal类的虚函数表中的speak覆盖掉，其他自身新定义的虚函数跟在此表后面，构成新的小猫类的虚函数表。

  上面一段代码的分析为

  ```powershell
  D:\Data_structure\Data_structure\c++\test>cl /d1 reportSingleClassLayoutAnimal "main.cpp"
  用于 x86 的 Microsoft (R) C/C++ 优化编译器 19.33.31630 版
  版权所有(C) Microsoft Corporation。保留所有权利。
  
  main.cpp
  
  class Animal    size(4): // animal的类，没有虚函数的话，由于没有属性，默认class size为1，但现在有个指针
          +---
   0      | {vfptr}        // animal类中有speak虚函数，所以生成一个虚函数指针，指向自己的虚函数表
          +---
  
  Animal::$vftable@:       // animal类的虚函数表
          | &Animal_meta   // 声明时animal的多态
          |  0
   0      | &Animal::speak // animal类下的第一个虚函数，位置是0
  
  Animal::speak this adjustor: 0
  
  /*************************************************************************************************/
  /*************************************************************************************************/
  
  class Cat       size(4):           // 继承了animal类下的虚函数指针，size 为 4 
          +---
   0      | +--- (base class Animal) // 基类为Animal
   0      | | {vfptr}                // 基类下的属性为虚函数指针一个
          | +---
          +---
  
  Cat::$vftable@:                    // Cat的虚函数表
          | &Cat_meta                // 声明是Cat类的多态
          |  0                       // 偏移为0
   0      | &Cat::speak              // cat类下的第一个虚函数，覆盖了animal类下的speak函数
  
  Cat::speak this adjustor: 0
  ```

##### 虚函数的使用

虚函数的适用情形主要是**父类指针（或引用，毕竟引用也是指针）指向子类对象**的时候。否则，不会动态多态。

例子：

```c++
void test()
{
	Animal an = Cat();
    an.speak();//输出动物，因为这是通过值来访问
}
```



当使用虚函数声明的方法时，会查询类自身的vfptr的指向，如果是父类对象的vfptr就会指向父类的该虚函数，如果是子类的对象，那就会让子类的vfptr重新为该父类的vfptr重新赋值，指向子类的虚函数表，以实现多态的目的。

##### 重载、重写（覆盖）、隐藏

这些都是函数的概念，适用于不同的情况，达成条件也不一致。这些都是多态的表现。

* 重载
  * 多个函数名一致，并且位于同一个命名空间下（比如同一个类下的成员函数、同一个namespace下、文件下）
  * 每个同名函数的参数情况不同
    * 参数数量不同（占位符也计数
    * 参数类型不同（占位符类型不同也算
  * 返回值类型不可以当作重载条件
  * 注意默认参数的使用，不要造成重载歧义
* 重写（覆盖）
  * 重写是指子类和父类之间的虚函数的关系
  * 子类继承父类的虚函数，需要重写修改成自己的实现（纯虚函数继承必须要重写）
  * 除了**同名，需要返回值、函数名、参数列表完全相同**
* 隐藏
  * 隐藏也是子类和父类的同名成员函数的关系，但是要求**父类的同名函数不为虚函数**
  * 子类的成员函数**一旦出现和父类的同名**，这就意味着父类的所有同名函数（包括各种重载）都会被隐藏掉。
  * 被隐藏的父类函数仍旧可以通过添加作用域的方式调用。（也就是说父类的函数子类仍然是继承下来的，放在了子类对应的代码区）

##### 纯虚函数和抽象类

在多态中，一般父类的函数实现都没啥意义（因为子类会重写），所以可以将虚函数改为纯虚函数。

写法：

```virtual 返回值类型 函数名 （参数列表） = 0 ```

当类中有了纯虚函数，这个类就被称为**抽象类**。

抽象类的特点：

* 无法实例化对象
* 子类必须重写抽象类中的函数，否则子类也为抽象类。

##### 虚析构和纯虚析构

问题：当父类指针指向子类对象时，发生父类的析构时，子类的析构是否会被调用？

* 不会。示例如下

  ```c++
  class Animal
  {
  public:
  	virtual void speak()
  	{
  		cout << "动物" << endl;
  	}
  	Animal()
  	{
  		cout << "animal 构造" << endl;
  	}
  	~Animal()
  	{
  		cout << "animal 析构" << endl;
  	}
  	//virtual ~Animal()
  	//{
  	//	cout << "animal 虚析构析构" << endl;
  	//}
  };
  
  class Cat : public Animal
  {
  public:
  	void speak()
  	{
  		cout << "小猫" << endl;
  	}
  	Cat()
  	{
  		cout << "Cat 构造" << endl;
  	}
  	~Cat()
  	{
  		cout << "Cat 析构" << endl;
  	}
  };
  
  class Catt :public Cat
  {
  public:
  	void speak()
  	{
  		cout << "猫猫" << endl;
  	}
  };
  
  void doSpeak(Animal& an)
  {
  	an.speak();
  }
  
  
  void test()
  {
  	Animal* cat = new Cat();
  	delete cat;
  }
  int main()
  {
      test();
  	system("pause");
  
  	return 0;
  }
  // 结果如下
  animal 构造
  Cat 构造
  animal 析构
  请按任意键继续. . .
  ```

* 那么如何解决这个问题呢？

  * 将父类指针改为虚析构或者纯虚析构。

* 虚析构和纯虚析构的共性：

  * 可以解决父类指针释放子类对象
  * 都需要具体实现

* 虚析构和纯虚析构的区别：

  * 纯虚析构会使得该类变为抽象类

* 语法：

  * ```virtual ~ class_name(){}```  or ```virtual ~class_name() = 0;```

* 实例：

  ```powershell
  // 将上述代码的Animal类的析构函数改为virtual ~Animal(){} 即可
  // 结果：
  /*
  animal 构造
  Cat 构造
  Cat 析构
  animal 虚析构析构
  请按任意键继续. . .*/
  
  // 解决Catt类的析构也一样，将Cat的析构函数改为虚析构即可。
  // 结果：
  /* 
  animal 构造
  Cat 构造
  Catt 构造
  Catt 析构
  Cat 析构
  animal 虚析构析构
  请按任意键继续. . .
  */
  class Cat       size(4):
          +---
   0      | +--- (base class Animal)
   0      | | {vfptr}
          | +---
          +---
  
  Cat::$vftable@:
          | &Cat_meta
          |  0
   0      | &Cat::speak
   1      | &Cat::{dtor}  // cat的虚析构函数位置
      
  
  ```

* 强调：

  * 子类和父类的虚析构代码都会走

  * 纯虚析构是要在类外实现且必须实现。（纯虚函数一般是为了父类不实现）

    * ```c++
      virtual ~class_name() = 0;
      // 类外
      class_name::~class_name()
      {
      	///实现代码
      }
      ```

  * 纯虚析构会使得本类成为抽象类。

  



## 提高篇

### 在提高篇主要想介绍内存模型、模板、多态和虚继承（和虚指针相关的内容）、另外就是c++QT的一些内容、cpp编译、链接的一些知识--可能需要一本c++ primer，但是现在没时间了

## 八股篇

### 八股篇打算找些cpp八股看看，写写分析。

## 举些栗子

1. 一秒打印一个字的方法

   ```c++
   int main()
   {
   	int now = time(NULL);
   	int temp = now;
   	char s[] = "这是一段话！";
   	short len = (sizeof(s) / sizeof(char)) - 1;
   	cout << len << endl;
   	for (int i = 0; i < len; ++i)
   	{
   		cout << s[i];
   		while (now == time(NULL))
   		{
   			
   		}
   		now = time(NULL);
   	}
   	cout << endl;
       
